<a href="https://colab.research.google.com/github/yardsale8/DSCI_210_R_notebooks/blob/main/lecture_8_3_reshaping_table_in_R.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Stacking and Unstacking in R

# Stack and Unstack


* `library(tidyr)` [Included in `library(tidyverse)`]
* Stack $\rightarrow$ `gather`
* Unstack $\rightarrow$ `spread`

In [1]:
library(tidyverse)

── Attaching core tidyverse packages ──────────────────────── tidyverse 2.0.0 ──
✔ dplyr     1.1.4     ✔ readr     2.1.5
✔ forcats   1.0.0     ✔ stringr   1.5.1
✔ ggplot2   3.4.4     ✔ tibble    3.2.1
✔ lubridate 1.9.3     ✔ tidyr     1.3.1
✔ purrr     1.0.2
── Conflicts ────────────────────────────────────────── tidyverse_conflicts() ──
✖ dplyr::filter() masks stats::filter()
✖ dplyr::lag()    masks stats::lag()
ℹ Use the conflicted package (<http://conflicted.r-lib.org/>) to force all conflicts to become errors

## Stacking columns with `gather` or `pivot_longer`

The function `gather` from the `tidyr` library is used to stack columns.

### Older approach: Stacking columns with `gather`

Arguments are:

1. label column name
2. data column name
3. then a list of columns to stack

#### Syntax
```{R}
...
%>% gather(key = "lbl1", value = "lbl2", col1, col2, col3, ...)
...
```

### A familiar example

In [2]:
sales <- read.csv("https://github.com/WSU-DataScience/DSCI_210_R_notebooks/raw/main/data/auto_sales.csv")
sales

  Salesperson Compact Sedan SUV Truck
1 Ann         22      18    15  12
2 Bob         19      12    17  20
3 Yolanda     19       8    32  15
4 Xerxes      12      23    18   9

#### Option 1: spell out all stacking columns

In [3]:
(sales
 %>% gather(key = "auto_type",
            value = "num_sales",
            Compact, Sedan, SUV, Truck)
) -> stacked_sales

head(stacked_sales)

  Salesperson auto_type num_sales
1 Ann         Compact   22
2 Bob         Compact   19
3 Yolanda     Compact   19
4 Xerxes      Compact   12
5 Ann         Sedan     18
6 Bob         Sedan     12

#### Option 2: refer to column range

In [4]:
(sales
 %>% gather(key = "auto_type",
            value = "num_sales",
            Compact:Truck)
) -> stacked_sales

head(stacked_sales)

  Salesperson auto_type num_sales
1 Ann         Compact   22
2 Bob         Compact   19
3 Yolanda     Compact   19
4 Xerxes      Compact   12
5 Ann         Sedan     18
6 Bob         Sedan     12

#### Option 3: select by exclusion

In [5]:
(sales
 %>% gather(key = "auto_type",
            value = "num_sales",
            -Salesperson)
) -> stacked_sales

head(stacked_sales)

  Salesperson auto_type num_sales
1 Ann         Compact   22
2 Bob         Compact   19
3 Yolanda     Compact   19
4 Xerxes      Compact   12
5 Ann         Sedan     18
6 Bob         Sedan     12

### Modern approach: Stacking columns with `pivot_longer`

The function `pivot_longer` is a newer version of `gather` with a cleaner syntax and more powerful features.

Arguments are:

1. label column name using `names_to = ...`
2. data column name using `values_to = ...`
3. then a list of columns to stack using `cols = `

#### Syntax
```{R}
...
%>% pivot_longer(cols = c(col1, col2, ...),
                 names_to = "name_col",
                 values_to = "value_col")
...
```

#### Option 1: List all the columns using `cols = c(...)`

In [7]:
(sales
 %>% pivot_longer(names_to = "auto_type",
                  values_to = "num_sales",
                  cols = c(Compact, Sedan, SUV, Truck))
) -> stacked_sales

head(stacked_sales)

  Salesperson auto_type num_sales
1 Ann         Compact   22
2 Ann         Sedan     18
3 Ann         SUV       15
4 Ann         Truck     12
5 Bob         Compact   19
6 Bob         Sedan     12

#### Option 2: Give a range of columns using `cols = col_1:col_n`

In [9]:
(sales
 %>% pivot_longer(names_to = "auto_type",
                  values_to = "num_sales",
                  cols = Compact:Truck)
) -> stacked_sales

head(stacked_sales)

  Salesperson auto_type num_sales
1 Ann         Compact   22
2 Ann         Sedan     18
3 Ann         SUV       15
4 Ann         Truck     12
5 Bob         Compact   19
6 Bob         Sedan     12

#### Option 3: Select by exclusion

In [11]:
(sales
 %>% pivot_longer(names_to = "auto_type",
                  values_to = "num_sales",
                  cols = -Salesperson)
) -> stacked_sales

head(stacked_sales)

  Salesperson auto_type num_sales
1 Ann         Compact   22
2 Ann         Sedan     18
3 Ann         SUV       15
4 Ann         Truck     12
5 Bob         Compact   19
6 Bob         Sedan     12

## <font color="red"> Exercise 8.3.1 </font>

Notice that the years are all in separate columns in the `world_bank_fresh_download.csv`.

In [6]:
world_bank = read.csv("https://github.com/WSU-DataScience/DSCI_210_R_notebooks/raw/main/data/world_bank_fresh_download.csv")
head(world_bank)

  Country Region Indicator        X1960        X1961        X1962
1 Algeria Africa Total_population 1.112489e+07 1.140486e+07 1.169015e+07
2 Algeria Africa CO2_emissions    5.537636e-01 5.318100e-01 4.849537e-01
3 Algeria Africa Life_expectancy  4.613512e+01 4.659032e+01 4.704500e+01
4 Algeria Africa Internet_usage             NA           NA           NA
5 Angola  Africa Total_population 5.270844e+06 5.367287e+06 5.465905e+06
6 Angola  Africa CO2_emissions    1.043571e-01 8.471841e-02 2.160253e-01
  X1963        X1964        X1965        X1966        ⋯ X2006
1 1.198513e+07 1.229597e+07 1.262695e+07 1.298027e+07 ⋯ 3.374933e+07
2 4.528245e-01 4.595689e-01 5.224485e-01 6.494806e-01 ⋯ 2.990267e+00
3 4.749620e+01 4.794190e+01 4.837610e+01 4.879080e+01 ⋯ 7.255771e+01
4           NA           NA           NA           NA ⋯ 7.375985e+00
5 5.565808e+06 5.665701e+06 5.765025e+06 5.863568e+06 ⋯ 1.854147e+07
6 2.068771e-01 2.161741e-01 2.060890e-01 2.651641e-01 ⋯ 1.200877e+00
  X2007        X2008        X2009        X2010        X2011        X2012
1 3.426197e+07 3.481106e+07 3.540179e+07 3.603616e+07 3.671713e+07 3.743943e+07
2 3.189978e+00 3.205183e+00 3.428472e+00 3.309912e+00 3.316038e+00           NA
3 7.289837e+01 7.321932e+01 7.352102e+01 7.380405e+01 7.407000e+01 7.432410e+01
4 9.451191e+00 1.018000e+01 1.123000e+01 1.250000e+01 1.400000e+01 1.522803e+01
5 1.918391e+07 1.984225e+07 2.052010e+07 2.121995e+07 2.194230e+07 2.268563e+07
6 1.311096e+00 1.369425e+00 1.430873e+00 1.401654e+00 1.354008e+00           NA
  X2013        X2014        X2015
1 3.818614e+07 3.893433e+07 39666519
2           NA           NA       NA
3 7.456895e+01 7.480810e+01       NA
4 1.650000e+01 1.809000e+01       NA
5 2.344820e+07 2.422752e+07 25021974
6           NA           NA       NA

#### Question

Why is this a violation of the Golden Rule?

<font color="orange">
Your answer here
</font>

#### Task 1

Fix this issue by

1. Use `gather` in a pipe to stack all these columns.  Store the years in a column called `year` and the number in a column called `values`.
2. Using `mutate`, `gsub`, and `as.numeric` to clean up the resulting `year` column and convert it to a numeric column.
3. Save the resulting dataframe to a variable named `world_bank_stacked`

In [ ]:
# Your code here

#### Task 2

Redo **Task 1**, but this time using `pivot_longer`.

In [ ]:
# Your code here

## Unstacking columns with `spread` and `pivot_wider`

### Older approach - Split the columns using `spread`

The function `spread`, also from the `tidyr` library, is used to stack columns.

Arguments:

1. Column to split on
2. Column to split

#### Syntax

```{r}
...
%>% spread(key = col1, value = col2)
...
```

#### A simple unstack

In [12]:
head(stacked_sales)

  Salesperson auto_type num_sales
1 Ann         Compact   22
2 Ann         Sedan     18
3 Ann         SUV       15
4 Ann         Truck     12
5 Bob         Compact   19
6 Bob         Sedan     12

In [16]:
(stacked_sales
 %>% spread(key = auto_type,
            value = num_sales)
 )

  Salesperson Compact Sedan SUV Truck
1 Ann         22      18    15  12
2 Bob         19      12    17  20
3 Xerxes      12      23    18   9
4 Yolanda     19       8    32  15

### Newer approach - Split the columns using `pivot_wider`

The function `pivot_wider` is an updated version of `spread` with a cleaner syntax and more powerful features.

Arguments:

1. Column to split on using `names_from = col1`
2. Column to split using `values_from = col2`
3. [Optional as needed] Columns to group on using `id_cols = c(...)`

#### Syntax

```{r}
...
%>% pivot_wider(names_from = col1,
                values_from = col2,
               )
...
```

#### A simple unstack with `pivot_wider`

In [15]:
head(stacked_sales)

  Salesperson auto_type num_sales
1 Ann         Compact   22
2 Ann         Sedan     18
3 Ann         SUV       15
4 Ann         Truck     12
5 Bob         Compact   19
6 Bob         Sedan     12

In [17]:
(stacked_sales
 %>% pivot_wider(names_from = auto_type,
                 values_from = num_sales,
                )
 )

  Salesperson Compact Sedan SUV Truck
1 Ann         22      18    15  12
2 Bob         19      12    17  20
3 Yolanda     19       8    32  15
4 Xerxes      12      23    18   9

## <font color="red"> Exercise 7.3.2 </font>

Continuing the `world_bank_fresh_download.csv`, notice that the labels in the `Indicator` column are actually variables.

In [ ]:
head(world_bank_stacked)

#### Question

Why is this a violation of the Golden Rule?

<font color="orange">
Your answer here
</font>

#### Task 1

Fix this issue by

1. Use `spread` in a pipe to unstack all these labels into their own columns.
2. Save the resulting dataframe to a variable named `world_bank_clean`

In [ ]:
# Your code here

#### Task 2

Redo the last problem using `pivot_wider`

In [ ]:
# Your code here